lkolbly/cmsis-svd/data/Holtek/HT32F52142.svd
        <!--IP2-->
        <register>
          <name>IP2</name>
          <displayName>IP2</displayName>
          <description>IP2</description>
          <addressOffset>0x00000408</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>PRI_8</name>
              <description>PRI_8</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_9</name>
              <description>PRI_9</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_10</name>
              <description>PRI_10</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_11</name>
              <description>PRI_11</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--IP3-->
        <register>
          <name>IP3</name>
          <displayName>IP3</displayName>
          <description>IP3</description>
          <addressOffset>0x0000040C</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>PRI_12</name>
              <description>PRI_12</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_13</name>
              <description>PRI_13</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_14</name>
              <description>PRI_14</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_15</name>
              <description>PRI_15</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--IP4-->
        <register>
          <name>IP4</name>
          <displayName>IP4</displayName>
          <description>IP4</description>
          <addressOffset>0x00000410</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>PRI_16</name>
              <description>PRI_16</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_17</name>
              <description>PRI_17</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_18</name>
              <description>PRI_18</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_19</name>
              <description>PRI_19</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--IP5-->
        <register>
          <name>IP5</name>
          <displayName>IP5</displayName>
          <description>IP5</description>
          <addressOffset>0x00000414</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>PRI_20</name>
              <description>PRI_20</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_21</name>
              <description>PRI_21</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_22</name>
              <description>PRI_22</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_23</name>
              <description>PRI_23</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--IP6-->
        <register>
          <name>IP6</name>
          <displayName>IP6</displayName>
          <description>IP6</description>
          <addressOffset>0x00000418</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>PRI_24</name>
              <description>PRI_24</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_25</name>
              <description>PRI_25</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_26</name>
              <description>PRI_26</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_27</name>
              <description>PRI_27</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--IP7-->
        <register>
          <name>IP7</name>
          <displayName>IP7</displayName>
          <description>IP7</description>
          <addressOffset>0x0000041C</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>PRI_28</name>
              <description>PRI_28</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_29</name>
              <description>PRI_29</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_30</name>
              <description>PRI_30</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_31</name>
              <description>PRI_31</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
        <!--IP8-->
        <register>
          <name>IP8</name>
          <displayName>IP8</displayName>
          <description>IP8</description>
          <addressOffset>0x00000420</addressOffset>
          <size>32</size><!--Bits-->
          <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
          <fields>
            <field>
              <name>PRI_32</name>
              <description>PRI_32</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_33</name>
              <description>PRI_33</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_34</name>
              <description>PRI_34</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
            <field>
              <name>PRI_35</name>
              <description>PRI_35</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access><!--read-only/write-only/read-write/writeOnce/read-writeOnce-->
            </field>
          </fields>
        </register>
